src/Reports/ОтчётПоНачатымПроизводственнымЗаданиям/ОтчётПоНачатымПроизводственнымЗаданиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоНачатымПроизводственнымЗаданиям</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/Catalogs/Линейки/Линейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Линейки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидЛинейки</name>
    <type>
      <types>EnumRef.ВидыЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторОчереди</name>
    <type>
      <types>CatalogRef.НумераторОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСтарое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияБрака</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьБарКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВБракВыпуском</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаAccess</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОдноПЗПоМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодкаталогФотографий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаЛинеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиПотребители</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКанбанов</name>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчётПоНачатымПроизводственнымЗаданиям/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьПоследнееРабочееМесто(Линейка)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РабочиеМестаЛинеек.Ссылка КАК Ссылка,
	|	РабочиеМестаЛинеек.Код КАК Код
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка = &Линейка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ";
Запрос.УстановитьПараметр("Линейка", Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(Справочники.Линейки.ПустаяСсылка());
КонецФункции

&НаСервере
Функция ПолучитьДатуНачала(ПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапыПроизводственныхЗаданийСрезПервых.ДатаНачала КАК ДатаНачала
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПервых КАК ЭтапыПроизводственныхЗаданийСрезПервых
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПервых.ПЗ = &ПЗ";
Запрос.УстановитьПараметр("ПЗ", ПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.ДатаНачала);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции

&НаСервере
Функция ПолучитьДатуОкончания(ПЗ,ПоследнееРабочееМесто)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ = &ПЗ
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.РабочееМесто = &РабочееМесто";
Запрос.УстановитьПараметр("ПЗ", ПЗ);
Запрос.УстановитьПараметр("РабочееМесто", ПоследнееРабочееМесто);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.ДатаОкончания);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции  

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка КАК Ссылка,
	|	ПроизводственноеЗадание.Линейка КАК Линейка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДатаЗапуска МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПроизводственноеЗадание.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроизводственноеЗадание.Линейка.Наименование,
	|	ПроизводственноеЗадание.Дата
	|ИТОГИ ПО
	|	Линейка";
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЛинейки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
НомСтр = 1;
	Пока ВыборкаЛинейки.Следующий() Цикл
	ПоследнееРабочееМесто = ПолучитьПоследнееРабочееМесто(ВыборкаЛинейки.Линейка);
	ВыборкаДетальныеЗаписи = ВыборкаЛинейки.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОблСтрока.Параметры.НомСтр = НомСтр;
		ОблСтрока.Параметры.Линейка = ВыборкаЛинейки.Линейка;
		ОблСтрока.Параметры.Товар = СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.Изделие.Товар.Наименование);
		ОблСтрока.Параметры.МТК = ВыборкаДетальныеЗаписи.Ссылка.ДокументОснование.Номер;
		ОблСтрока.Параметры.ПЗ = ВыборкаДетальныеЗаписи.Ссылка.Номер;
		ОблСтрока.Параметры.БарКод = ВыборкаДетальныеЗаписи.Ссылка.БарКод;
		ОблСтрока.Параметры.КодДанфосс = ОбщийМодульВызовСервера.ПолучитьКодDanfoss(ВыборкаДетальныеЗаписи.Ссылка.БарКод);
		ОблСтрока.Параметры.ДатаОтгрузки = Формат(ВыборкаДетальныеЗаписи.Ссылка.ДокументОснование.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
		ОблСтрока.Параметры.Счёт = ВыборкаДетальныеЗаписи.Ссылка.ДокументОснование.Счёт;
		ОблСтрока.Параметры.ДатаНач = ПолучитьДатуНачала(ВыборкаДетальныеЗаписи.Ссылка);
		ОблСтрока.Параметры.ДатаКон = ПолучитьДатуОкончания(ВыборкаДетальныеЗаписи.Ссылка,ПоследнееРабочееМесто);
		ТабДок.Вывести(ОблСтрока);
		НомСтр = НомСтр + 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
